src/cf/Documents/ЗаданиеНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаОтгрузку</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ТоварныеЗапасы</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГуидТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЗаданиеНаПриёмку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаПриёмку</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварныеЗапасы</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГуидТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Товары</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗаказКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/РасходТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходТовара</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ТоварныеЗапасы</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбоснованиеОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Товары</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗаказКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ПриходТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходТовара</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварныеЗапасы</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/РаботаСОчередями/Ext/Module.bsl
Функция СериализоватьВJson(Ссылка)   Экспорт 
	 //	 
	 //	 // Создаем сложную структуру
	 //Шапка = Новый Структура;
	 //Шапка.Вставить("Склад", Ссылка.Склад);
	 //Шапка.Вставить("Организация", Ссылка.Организация); 
	 
	 //Для Каждого СтрокаТовары
	 
	 //// Телефоны как массив
	 //Телефоны = Новый Массив;
	 //Телефоны.Добавить("+7-999-123-45-67");
	 //Телефоны.Добавить("+7-495-765-43-21");
	 //ДанныеПользователя.Вставить("Телефоны", Телефоны);
	 
	 //// Сериализуем
	 //ЗаписьJSON = Новый ЗаписьJSON;
	 //ЗаписьJSON.УстановитьСтроку();
	 //ЗаписьJSON.ЗаписатьЗначение(ДанныеПользователя);
	 //JSONСтрока = ЗаписьJSON.Закрыть();
	 
	 //Сообщить(JSONСтрока);
	 
	 //	 
	 
	 //
	 //ЗаписьJson=Новый ЗаписьJSON;
	 //ЗаписьJson.УстановитьСтроку();  
	 //
	 СсылкаСтруктура= КонвертироватьОбъектВСтруктуру(Ссылка);
	 //СериализаторXDTO.ЗаписатьJSON(ЗаписьJson,СсылкаСтруктура,НазначениеТипаXML.Явное);
	 ////СериализаторXDTO.ЗаписатьJSON(ЗаписьJson,Ссылка.ПолучитьОбъект());
	 СтрСообщ=ОбъектВJson(СсылкаСтруктура);
	 Возврат СтрСообщ;
	 
 КонецФункции 
 
 Функция КонвертироватьОбъектВСтруктуру(ВходящийОбъект)
	 
	 СтруктураОбъекта = Новый Структура;
	 
	 СтандартныеРеквизитыОбъекта = ВходящийОбъект.Метаданные().СтандартныеРеквизиты;
	 Для Каждого СтандартныйРеквизит Из СтандартныеРеквизитыОбъекта Цикл
		 СтруктураОбъекта.Вставить(СтандартныйРеквизит.Имя, ""+ВходящийОбъект[СтандартныйРеквизит.Имя]);
	 КонецЦикла;
	 
	 РеквизитыОбъекта = ВходящийОбъект.Метаданные().Реквизиты;
	 Для Каждого Реквизит Из РеквизитыОбъекта Цикл
		 СтруктураОбъекта.Вставить(Реквизит.Имя,""+ ВходящийОбъект[Реквизит.Имя]);
	 КонецЦикла;
	 
	 ТЧ = ВходящийОбъект.Метаданные().ТабличныеЧасти;
	 Для Каждого ТаблЧасть Из ТЧ Цикл
		 ТЗ = ВходящийОбъект[ТаблЧасть.Имя].Выгрузить();
		 Массив = ТаблицаЗначенийВМассив(ТЗ);
		 СтруктураОбъекта.Вставить(ТаблЧасть.Имя, Массив);
	 КонецЦикла;
	 
	 Возврат СтруктураОбъекта;
	 
 КонецФункции  
 
 Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
	 
	 Массив = Новый Массив();
	 СтруктураСтрокой = "";
	 НужнаЗапятая = Ложь;
	 Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		 Если НужнаЗапятая Тогда
			 СтруктураСтрокой = СтруктураСтрокой + ",";
		 КонецЕсли;
		 СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		 НужнаЗапятая = Истина;
	 КонецЦикла;
	 Для Каждого Строка Из ТаблицаЗначений Цикл 
		 
		 НоваяСтрока = Новый Структура(СтруктураСтрокой);
		 ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		 Для Каждого СтркаСтр Из НоваяСтрока Цикл 
			 НоваяСтрока.Вставить(СтркаСтр.Ключ, ""+СтркаСтр.Значение);
			 
			 //	   НоваяСтрока[СтркаСтр.Ключ]
			 //	   СтркаСтр.Значение=""+СтркаСтр.Значение;
			 //к=5;   
		 КонецЦикла;
		 Массив.Добавить(НоваяСтрока);
	 КонецЦикла;
	 Возврат Массив;
	 
 КонецФункции   
 
 
 // Преобразование Объекта в JSON.
 //
 // Параметры:
 //   Объект - Произвольный - данные, которые необходимо преобразовать в JSON.
 //   ПараметрыПреобразования - Структура - кодировка текста JSON. Значение по умолчанию - utf-8.
 //      *ФорматДатыJSON - ФорматДатыJSON - определяет формат сериализации дат JSON-объектов.
 //   ПараметрыЗаписи - Структура - параметры преобразования JSON:
 //      *ПереносСтрок - ПереносСтрокJSON - определяет способ переноса строк,
 //                      который будет использован при записи данных JSON.
 //      *СимволыОтступа - Строка - определяет символы отступа, используемые при записи данных JSON.
 //      *ИспользоватьДвойныеКавычки - Булево - определяет, будут ли при записи имена свойств JSON
 //                                    записываться в двойных кавычках.
 //      *ЭкранированиеСимволов - ЭкранированиеСимволовJSON - определяет используемый способ экранирования (замены)
 //                               символов при записи данных JSON.
 //      *ЭкранироватьУгловыеСкобки - Булево - определяет, будут ли при записи экранироваться символы "<" и ">".
 //      *ЭкранироватьРазделителиСтрок - Булево - определяет, будут ли экранироваться разделители строк
 //                                      U+2028 (line-separator) и U+2029 (page-separator).
 //      *ЭкранироватьАмперсанд - Булево - определяет, будет ли при записи экранироваться символ амперсанда "&".
 //      *ЭкранироватьОдинарныеКавычки - Булево - определяет, будут ли экранироваться одинарные кавычки.
 //      *ЭкранироватьСлеш - Булево - определяет, будет ли экранироваться слеш (косая черта) при записи значения.
 // 
 // Возвращаемое значение:
 //   Строка - объект в формате JSON. 
 //
 Функция ОбъектВJson(Объект, Знач ПараметрыПреобразования = Неопределено, Знач ПараметрыЗаписи = Неопределено) Экспорт
	 
	 ПараметрыПреобразованияJSON = ДополнитьПараметрыПреобразованияJSON(ПараметрыПреобразования);
	 
	 НастройкиСериализации = Новый НастройкиСериализацииJSON;
	 НастройкиСериализации.ФорматСериализацииДаты = ПараметрыПреобразованияJSON.ФорматДатыJSON;
	 
	 ПараметрыЗаписи = ДополнитьПараметрыЗаписиJSON(ПараметрыЗаписи);
	 
	 ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(
	 ПараметрыЗаписи.ПереносСтрок,
	 ПараметрыЗаписи.СимволыОтступа,
	 ПараметрыЗаписи.ИспользоватьДвойныеКавычки,
	 ПараметрыЗаписи.ЭкранированиеСимволов,
	 ПараметрыЗаписи.ЭкранироватьУгловыеСкобки,
	 ПараметрыЗаписи.ЭкранироватьРазделителиСтрок,
	 ПараметрыЗаписи.ЭкранироватьАмперсанд,
	 ПараметрыЗаписи.ЭкранироватьОдинарныеКавычки,
	 ПараметрыЗаписи.ЭкранироватьСлеш);
	 
	 ЗаписьJSON = Новый ЗаписьJSON;
	 ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	 ЗаписатьJSON(ЗаписьJSON, Объект,НастройкиСериализации);
	 
	 Возврат ЗаписьJSON.Закрыть();
	 
 КонецФункции
 
 // Преобразование JSON в Объект.
 //
 // Параметры:
 //   Json - Поток, ДвоичныеДанные - данные в формате JSON.
 //   Кодировка - Строка - кодировка текста JSON. Значение по умолчанию - utf-8.
 //   ПараметрыПреобразования - Структура - параметры преобразования JSON:
 //      *ПрочитатьВСоответствие - Булево - если Истина, чтение объекта JSON будет выполнено в Соответствие,
 //                                         иначе в Структура.
 //      *ИменаСвойствСоЗначениямиДата - Массив, Строка, ФиксированныйМассив - имена свойств JSON,
 //                                      для которых нужно вызывать восстановление даты из строки.
 //      *ФорматДатыJSON - ФорматДатыJSON - определяет формат десериализации дат JSON-объектов.
 // 
 // Возвращаемое значение:
 //   Произвольный - значение, десериализованное из JSON. 
 //
 Функция JsonВОбъект(Json, Кодировка = "utf-8", ПараметрыПреобразования = Неопределено) Экспорт
	 
	 ПараметрыПреобразованияJSON = ДополнитьПараметрыПреобразованияJSON(ПараметрыПреобразования);
	 
	 ЧтениеJSON = Новый ЧтениеJSON; 
	 
	 ЧтениеJSON.УстановитьСтроку(Json);
	 //Если ТипЗнч(Json) = Тип("ДвоичныеДанные") Тогда
	 //	ЧтениеJSON.ОткрытьПоток(Json.ОткрытьПотокДляЧтения(), Кодировка);
	 //Иначе
	 //	ЧтениеJSON.ОткрытьПоток(Json, Кодировка);
	 //КонецЕсли;
	 Объект = ПрочитатьJSON(
	 ЧтениеJSON, 
	 ПараметрыПреобразованияJSON.ПрочитатьВСоответствие,
	 ПараметрыПреобразованияJSON.ИменаСвойствСоЗначениямиДата,
	 ПараметрыПреобразованияJSON.ФорматДатыJSON);
	 ЧтениеJSON.Закрыть();
	 
	 Возврат Объект;
	 
 КонецФункции 
 
 Функция ДополнитьПараметрыПреобразованияJSON(ПараметрыПреобразования)
	 
	 ПараметрыПреобразованияJSON = ПолучитьПараметрыПреобразованияJSONПоУмолчанию();
	 Если ЗначениеЗаполнено(ПараметрыПреобразования) Тогда
		 Для Каждого Параметр Из ПараметрыПреобразования Цикл
			 Если ПараметрыПреобразованияJSON.Свойство(Параметр.Ключ) Тогда
				 ПараметрыПреобразованияJSON.Вставить(Параметр.Ключ, Параметр.Значение);
			 КонецЕсли;
		 КонецЦикла;
	 КонецЕсли;
	 
	 Возврат ПараметрыПреобразованияJSON;
	 
 КонецФункции
 
 Функция ДополнитьПараметрыЗаписиJSON(ПараметрыЗаписи)
	 
	 ПараметрыЗаписиJSON = ПолучитьПараметрыЗаписиJSONПоУмолчанию();
	 Если ЗначениеЗаполнено(ПараметрыЗаписи) Тогда
		 Для Каждого Параметр Из ПараметрыЗаписи Цикл
			 Если ПараметрыЗаписиJSON.Свойство(Параметр.Ключ) Тогда
				 ПараметрыЗаписиJSON.Вставить(Параметр.Ключ, Параметр.Значение);
			 КонецЕсли;
		 КонецЦикла;
	 КонецЕсли;
	 
	 Возврат ПараметрыЗаписиJSON;
	 
 КонецФункции     
 
 
 Функция ПолучитьПараметрыПреобразованияJSONПоУмолчанию()
	 
	 ПараметрыПреобразованияПоУмолчанию = Новый Структура;
	 ПараметрыПреобразованияПоУмолчанию.Вставить("ПрочитатьВСоответствие", Истина);
	 ПараметрыПреобразованияПоУмолчанию.Вставить("ФорматДатыJSON", ФорматДатыJSON.ISO);
	 ПараметрыПреобразованияПоУмолчанию.Вставить("ИменаСвойствСоЗначениямиДата", Неопределено);
	 
	 Возврат ПараметрыПреобразованияПоУмолчанию;
	 
 КонецФункции
 
 Функция ПолучитьПараметрыЗаписиJSONПоУмолчанию()
	 
	 ПараметрыЗаписиJSONПоУмолчанию = Новый Структура;
	 ПараметрыЗаписиJSONПоУмолчанию.Вставить("ПереносСтрок", ПереносСтрокJSON.Авто);
	 ПараметрыЗаписиJSONПоУмолчанию.Вставить("СимволыОтступа", " ");
	 ПараметрыЗаписиJSONПоУмолчанию.Вставить("ИспользоватьДвойныеКавычки", Истина);
	 ПараметрыЗаписиJSONПоУмолчанию.Вставить("ЭкранированиеСимволов", ЭкранированиеСимволовJSON.Нет);
	 ПараметрыЗаписиJSONПоУмолчанию.Вставить("ЭкранироватьУгловыеСкобки", Ложь);
	 ПараметрыЗаписиJSONПоУмолчанию.Вставить("ЭкранироватьРазделителиСтрок", Истина);
	 ПараметрыЗаписиJSONПоУмолчанию.Вставить("ЭкранироватьАмперсанд", Ложь);
	 ПараметрыЗаписиJSONПоУмолчанию.Вставить("ЭкранироватьОдинарныеКавычки", Ложь);
	 ПараметрыЗаписиJSONПоУмолчанию.Вставить("ЭкранироватьСлеш", Ложь);
	 
	 Возврат ПараметрыЗаписиJSONПоУмолчанию;
	 
 КонецФункции  
 
 
 
 Функция СоздатьЗадание(СтруктураСообщения)Экспорт
	 
	 
	 Если СтруктураСообщения["ЭтоЗаказКлиента"]="Да" Тогда 
		 ДокументЗаказ=Документы.ЗаданиеНаОтгрузку.СоздатьДокумент();
	 Иначе
		 ДокументЗаказ=Документы.ЗаданиеНаПриёмку.СоздатьДокумент();
		 
	 КонецЕсли; 
	 
	 ДокументЗаказ.Номер=СтруктураСообщения["Номер"];
	 ДокументЗаказ.Дата=СтруктураСообщения["Дата"];
	 ДокументЗаказ.Склад=Справочники.Склады.НайтиПоНаименованию(СтруктураСообщения["Склад"]);
	 ДокументЗаказ.Организация=Справочники.Организации.НайтиПоНаименованию(СтруктураСообщения["Организация"]);
	 ДокументЗаказ.Состояние=Перечисления.СостоянияЗаказов.Открыт; 
	 
	 Для каждого СтрокаМассиваТЧ    Из СтруктураСообщения["Товары"] Цикл  
		 НовяСтрокаТоварв=ДокументЗаказ.Товары.Добавить();
		 НовяСтрокаТоварв.Товар=Справочники.Товары.НайтиПоНаименованию(СтрокаМассиваТЧ["Товар"]);
		 
		 НовяСтрокаТоварв.Количество=СтрокаМассиваТЧ["Количество"];
	 КонецЦикла; 
	 
	 Попытка
		 ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение); 
	 Исключение 
	     Сообщить("Сообщение:"+ОписаниеОшибки());
		 ДокументЗаказ=Неопределено;
	 КонецПопытки;
	 
	 Возврат ДокументЗаказ;
	 
 КонецФункции 
 
 
 Функция ОбработатьЗаказ(СтруктураСообщения)Экспорт  
	 
	 
	 Если СтрНайти(СтруктураСообщения["Ссылка"],"Задание на отгрузку") = 1 Тогда 
		 ДокументЗаказ=Документы.ЗаказКлиента.НайтиПоНомеру(СтруктураСообщения["Номер"]);
		 
		 ДокументНовый=Документы.РасходТовара.СоздатьДокумент();  
		 		 
	 Иначе
		 ДокументЗаказ=Документы.ЗаказПоставщику.НайтиПоНомеру(СтруктураСообщения["Номер"]);  	 
		 ДокументНовый=Документы.ПриходТовара.СоздатьДокумент();  	 
	 КонецЕсли; 
	 
	 ДокументНовый.Номер=СтруктураСообщения["Номер"];
	 ДокументНовый.Дата=СтруктураСообщения["Дата"];
	 
	 ДокументНовый.Заполнить(ДокументЗаказ);
	 Попытка
	 ДокументНовый.Записать(РежимЗаписиДокумента.Проведение);
 Исключение  
	 ДокументНовый=Неопределено;
	 Сообщить("Сообщение:"+ОписаниеОшибки());
	 КонецПопытки;
	 
	 Возврат ДокументНовый;
	 
 КонецФункции
